# **Task 4**

Deadline: Wednesday at 11:59pm

1. **Data Exploration**
 * How many employees are in the dataset?
 * How many missing values exist in each column?
 * What are the unique job titles and departments?
 * Identify duplicate employee records and remove them.

2. **Data Cleaning**
 * Convert salaries from text to numeric (e.g., "$50,000" → 50000).
 * Standardize job titles (fix inconsistencies like “manager” vs. “Manager”) change everything to start with uppercase.
 * Fill missing values in performance scores using median or mean.
 * Detect and remove outliers in salary (any salaries too high/low?).
 * Convert date columns (e.g., "01-12-2023" as string → datetime format).

3. **Analysis**
 * What is the average salary of employees?
 * Which department has the highest average salary?
 * Which department has the lowest performance scores?
 * Which job title has the highest average salary?

4. **Department-Level Insights**
 * Which department has the most employees?
 * What is the salary distribution across departments?
 * Identify departments with the most missing data.

In [339]:
import pandas as pd
df =pd.read_csv("employee.csv.csv")
df

,Employee_ID,Name,Department,Job_Title,Salary,Experience_Years,Performance_Score,Join_Date
0,EMP1000,Employee_0,Marketing,Analyst,NaN,NaN,3.0,3/30/2018
1,EMP1001,Employee_1,Marketing,Coordinator,"$70,000",5.0,3.0,NaN
2,EMP1002,Employee_2,Customer Support,Manager,NaN,15.0,1.0,6/25/2019
3,EMP1003,Employee_3,Finance,Specialist,NaN,20.0,5.0,1/10/2020
4,EMP1004,Employee_4,Sales,Analyst,"$150,000",15.0,1.0,1/10/2020
...,...,...,...,...,...,...,...,...
1015,EMP1899,Employee_899,Customer Support,engineer,"$120,000",3.0,NaN,3/30/2018
1016,EMP1280,Employee_280,Customer Support,engineer,"$120,000",1.0,NaN,NaN
1017,EMP1883,Employee_883,Engineering,coordinator,NaN,NaN,4.0,3/30/2018
1018,EMP1761,Employee_761,Finance,analyst,"$50,000",15.0,5.0,9/15/2021
1019,EMP1319,Employee_319,Marketing,specialist,"$50,000",NaN,5.0,3/30/2018

In [340]:

num_employees=df.shape[0]
num_employees

1020

In [341]:
missing_vallues=df.isnull().sum()
missing_vallues

Employee_ID            0
Name                   0
Department             0
Job_Title              0
Salary               123
Experience_Years     136
Performance_Score    162
Join_Date            157
dtype: int64

In [342]:
Unique_job_titles=df['Job_Title'].unique()
Unique_departments=df['Department'].unique()
Unique_job_titles
Unique_departments

array(['Marketing', 'Customer Support', 'Finance', 'Sales', 'Engineering',
       'HR'], dtype=object)

In [343]:
#remove duplicate employee records
df_cleaned=df.drop_duplicates()
df_cleaned

,Employee_ID,Name,Department,Job_Title,Salary,Experience_Years,Performance_Score,Join_Date
0,EMP1000,Employee_0,Marketing,Analyst,NaN,NaN,3.0,3/30/2018
1,EMP1001,Employee_1,Marketing,Coordinator,"$70,000",5.0,3.0,NaN
2,EMP1002,Employee_2,Customer Support,Manager,NaN,15.0,1.0,6/25/2019
3,EMP1003,Employee_3,Finance,Specialist,NaN,20.0,5.0,1/10/2020
4,EMP1004,Employee_4,Sales,Analyst,"$150,000",15.0,1.0,1/10/2020
...,...,...,...,...,...,...,...,...
996,EMP1996,Employee_996,Sales,Executive,"$120,000",20.0,1.0,NaN
997,EMP1997,Employee_997,Engineering,Manager,"$120,000",NaN,5.0,NaN
998,EMP1998,Employee_998,Sales,specialist,"$60,000",5.0,2.0,7/20/2017
999,EMP1999,Employee_999,Engineering,Manager,"$45,000",10.0,NaN,NaN
1013,EMP1973,Employee_973,Customer Support,coordinator,"$150,000",10.0,1.0,1/10/2020

In [344]:
#convert salary to numeric
df_cleaned["Salary"] = df_cleaned["Salary"].replace('[\$,]')
df_cleaned['Salary'] = pd.to_numeric(df_cleaned['Salary'],errors='coerce')
df_cleaned['Salary']

<>:2: SyntaxWarning: invalid escape sequence '\$'
<>:2: SyntaxWarning: invalid escape sequence '\$'
C:\Users\USER\AppData\Local\Temp\ipykernel_29328\382536067.py:2: SyntaxWarning: invalid escape sequence '\$'
  df_cleaned["Salary"] = df_cleaned["Salary"].replace('[\$,]')
C:\Users\USER\AppData\Local\Temp\ipykernel_29328\382536067.py:2: FutureWarning: Series.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  df_cleaned["Salary"] = df_cleaned["Salary"].replace('[\$,]')
C:\Users\USER\AppData\Local\Temp\ipykernel_29328\382536067.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned["Salary"] = df_cleaned["Salary"].replace('[\$,]')
C:\Users\USER\AppData\Local\Temp\ipykernel_29328\382536067.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned['Salary'] = pd.to_numeric(df_cleaned['Salary'],errors='coerce')

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
        ..
996    NaN
997    NaN
998    NaN
999    NaN
1013   NaN
Name: Salary, Length: 1001, dtype: float64

In [345]:
df_cleaned["Job_Title"] = df_cleaned["Job_Title"].str.capitalize()
df_cleaned["Job_Title"]

C:\Users\USER\AppData\Local\Temp\ipykernel_29328\623898913.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned["Job_Title"] = df_cleaned["Job_Title"].str.capitalize()

0           Analyst
1       Coordinator
2           Manager
3        Specialist
4           Analyst
           ...
996       Executive
997         Manager
998      Specialist
999         Manager
1013    Coordinator
Name: Job_Title, Length: 1001, dtype: object

In [2]:
#check missing vallues
mode=df_cleaned['Performance_Score'].mode()

#fill missing vallues in performance
df_cleaned['Performance_Score']=df_cleaned['Performance_Score'].fillna(mode[0])
df_cleaned['Performance_Score']

NameError: name 'df_cleaned' is not defined

In [347]:
#Remove Outliers

In [348]:
#convert date columns
df_cleaned["Join_Date"] = pd.to_datetime(df_cleaned["Join_Date"])
df_cleaned["Join_Date"]

C:\Users\USER\AppData\Local\Temp\ipykernel_29328\4239629010.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned["Join_Date"] = pd.to_datetime(df_cleaned["Join_Date"])

0      2018-03-30
1             NaT
2      2019-06-25
3      2020-01-10
4      2020-01-10
          ...
996           NaT
997           NaT
998    2017-07-20
999           NaT
1013   2020-01-10
Name: Join_Date, Length: 1001, dtype: datetime64[ns]

In [349]:

Average_Salary = df_cleaned['Salary'].mean()
Average_Salary

nan

In [350]:
Highest_salary=df_cleaned.groupby('Department')['Salary'].mean().idxmax()
Highest_salary

C:\Users\USER\AppData\Local\Temp\ipykernel_29328\3657112436.py:1: FutureWarning: The behavior of Series.idxmax with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  Highest_salary=df_cleaned.groupby('Department')['Salary'].mean().idxmax()

nan

In [351]:
Lowest_salary = df_cleaned.groupby("Department")['Performance_Score'].mean().idxmin()
Lowest_salary

'Customer Support'

In [352]:
job_highest_salary = df_cleaned.groupby("Job_Title")["Salary"].mean().idxmax()
job_highest_salary

C:\Users\USER\AppData\Local\Temp\ipykernel_29328\3763018612.py:1: FutureWarning: The behavior of Series.idxmax with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  job_highest_salary = df_cleaned.groupby("Job_Title")["Salary"].mean().idxmax()

nan

In [353]:
department_most_employees = df_cleaned["Department"].value_counts().idxmax()
department_most_employees

'Customer Support'

In [354]:
#Salary distribution accross departments 
distribution = df_cleaned.groupby("Department")["Salary"].describe()
distribution

                  count  mean  std  min  25%  50%  75%  max
Department
Customer Support    0.0   NaN  NaN  NaN  NaN  NaN  NaN  NaN
Engineering         0.0   NaN  NaN  NaN  NaN  NaN  NaN  NaN
Finance             0.0   NaN  NaN  NaN  NaN  NaN  NaN  NaN
HR                  0.0   NaN  NaN  NaN  NaN  NaN  NaN  NaN
Marketing           0.0   NaN  NaN  NaN  NaN  NaN  NaN  NaN
Sales               0.0   NaN  NaN  NaN  NaN  NaN  NaN  NaN

In [355]:
#departments with the most missing data
missing_data = df_cleaned.isnull().groupby(df_cleaned["Department"]).sum()
missing_data

,Employee_ID,Name,Department,Job_Title,Salary,Experience_Years,Performance_Score,Join_Date
Department,,,,,,,,
Customer Support,0,0,0,0,178,19,0,31
Engineering,0,0,0,0,156,25,0,22
Finance,0,0,0,0,159,24,0,21
HR,0,0,0,0,166,26,0,30
Marketing,0,0,0,0,166,24,0,26
Sales,0,0,0,0,176,16,0,23